{
  "main": {
    "name":"Duong Dinh",
    "occupation":"Junior Web Developer",
    "description":"A hard-working junior web developer having 2 years of experience in developing user. Interface application, with a flair for creating elegant solutions and web interface. Developed an e-commerce web app, hotel resort with room selection web portal, familiar with MERN stack. Passionate about software architecture and a spirit to learn new things. Seeking opportunities and guidance from experienced senior developers.",
    "image":"profilepic.jpg",
    "bio":"My name is Duong Dinh. I am finishing my degree in Web development from Turku University of Applied Sciences. I am quite focused on making my career in the Web development sector, especially in creating Web pages with feature-rich user experience and a beautiful interface. Besides, although I am an entry level candidate, I have solid knowledge about the core fundamentals of Web technology (HTML, CSS, and JavaScript) and React as well as some of the related software. In addition to my studies, I have been engaged in web development a long time ago as an amateur and, due to the interaction with a website called Awwwards contingently, it inspired me to become an autodidact web developer. I have tutored to develop web-based applications such as e(commercial, hotel room selection, and a replicated social network, etc. from design to coding and full implementation under the help of my online tutors.",
    "contactmessage":"Feel free to contact me via email or phone.",
    "email": "ulrich.dinh168@gmail.com",
    "phone": "+358 465666696",
    "address":{
      "city":"Espoo",
      "zip": "02600"
    },
    "website": "https://ulrich-portfolio.netlify.app/",
    "resumedownload":"https://drive.google.com/file/d/1sTgL97u5T-bLaAwZJlyaOhkR9tBUuD95/view?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"http://facebook.com",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/duong-dinh-10b391106/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/UlrichDinh168",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"Turku University of Applied Sciences",
        "degree":"Bachelor's Degree in Infomation and Communication Technology"
      }
    ],
    "work":[
      {
        "company":"The Firma | Toimipiste",
        "title":"Front-end developer",
        "years":"June 2020 - July 2020",
        "description":"Managing weekly meetings and dividing tasks between members through Trello. Discussing and fixing bugs through weekly reports"
      },
      {
        "company":"The Firma",
        "title":"UI developer",
        "years":"June 2018 - September 2018",
        "description":"Using AdobeXD to design an client application interfaces for reporting bully activities among children throughout schools. Answering client's requesting regarding updates and product delivery. Providing ideas and frameworks, instructions, documents, etc to make a prototype becomes actual product."
      },
      {
        "company":"The Firma | Capstone Turkuamk",
        "title":"Front-end developer",
        "years":"October 2017 - March 2018",
        "description":"University curriculum: Innovation Project. Adding features and renovate Capstone Turkuamk website using Wordpress/PHP. Implementing and enhance visual using CSS3 and JavaScript. Optimizing codebase by using ES6 features"
      },
      {
        "company":"Turkuamk | The SHIFT Festival",
        "title":"Front-end UI developer",
        "years":"October 2017 - February 2018",
        "description":"University curriculum: SHIFT Business Festival. Increased customer satisfaction and implemented Agile development process."
      },
      {
        "company":"Turkuamk | Turku Student Ambassador",
        "title":"Front-end UI developer",
        "years":"January 2017 - December 2017",
        "description":"University Project: Turku Student Ambassador Website. Enhancing visual appreanace of Turku Student Ambassador Website. Applying optimization to project's codebase using ES6 features. Creating documents for upcomming website's manager"
      }
    ],
    "skills":[
      {
        "name":"HTML/CSS/JavaScript",
        "level":"80%"
      },
      {
        "name":"Sass",
        "level":"60%"
      },
      {
        "name":"Styled Components",
        "level":"60%"
      },
      {
        "name":"React",
        "level":"65%"
      },
      {
        "name":"Redux",
        "level":"55%"
      },
      {
        "name":"TypeScript",
        "level":"50%"
      },
      {
        "name":"NodeJS",
        "level":"60%"
      },
      {
        "name":"MongoDB",
        "level":"50%"
      },
      {
        "name":"Firease",
        "level":"50%"
      },
      {
        "name":"Express",
        "level":"60%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Resort Room Selection",
        "category":"A simple hotel-like website built using React, React Context, CSS, database stored in Contentful, and deploy using netlify",
        "image":"resort.jpeg",
        "url":"https://resort-ulrich.netlify.app"
      },
      {
        "title":"Food API Fetching",
        "category":"A simple website applies API fetching",
        "image":"food.jpg",
        "url":"https://ulrich-food-api.netlify.app"
      },
      {
        "title":"Weather API Fetching",
        "category":"A simple API fetching for weather",
        "image":"weather.png",
        "url":"https://weather-ulrich.netlify.app/"
      },
      {
        "title":"Online Chat Application",
        "category":"Realtime chat application",
        "image":"realtime-chat-app.png",
        "url":"https://chat-app-ulrich.netlify.app/"
      }
    ]
  }
}
